Week8/B_SwissCheeseHeatTransfer/Bb_SwissCheeseConvectionTurbulentWater/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e5;

boundaryField
{
    "sphereRegion.*"
    {
        type            fixedFluxPressure;
        value           uniform 1e5;
    }

    left
    {
        type            fixedFluxPressure;
        value           uniform 1e5;
    }

    right
    {
        type            fixedValue;
        value           uniform 1e5;
    }

    outside
    {
        type            fixedFluxPressure;
        value           uniform 1e5;
    }
}


// ************************************************************************* //
