Week8/B_SwissCheeseHeatTransfer/Bb_SwissCheeseConvectionTurbulentWater/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 293;

boundaryField
{
    "sphereRegion.*"
    {
        type            fixedValue;
        value           uniform 373;
    }

    left
    {
        type            fixedValue;
        value           uniform 293;
    }

    right
    {
        type            inletOutlet;
        inletValue      $internalField;
    }

    outside
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
